import back from '../assets/back.jpeg'

const About = () => {
    return (
        <section className='flex flex-col gap-5 z-0 max-w-[1024px] mx-auto h-[70vh]'>

            <h1 className='text-[30px] weight-bold'>Про мене</h1>
            <div className='relative'>
                <p className="pr-[30%]">
                    Привіт! Радий тебе/вас бачити у себе на сторінці. Я ще над нею працюю у перервах між роботою та обробкою фото, тому ще буде багато цікавого
                    Рубрика ж «Про мене», тому розповім трішки про свій шлях та ставлення до фотографії. Взагалі у мене, мабуть як і в більшості українців, декілька дипломів про вищу освіту (європейські та східні мови, право і т.д.), але зупинився на тому, чим захоплюватися почав ще зі студентських років. До речі, захоплення триває, можливо в іншій формі.
                    Для мене фотографія - це перш за все процес, що включає підготовку (технічну, підбір референсів, нові ідеї, спілкування з замовником), саме фотографування і постобробку. Процес цілісний, інтегрований і нероздільний. Під час підготовки люблю черпати натхнення з музики, фільмів, серіалів, поезії, людей.
                    Найближчі мені LoveStory фотосесії, сімейні фото та портрет. Репортажне фото на ширік – то OneLove.
                    Переходьте у галерею – там є приклади моїх робіт. Буду вдячний за фідбек у месенджерах та соціальних мережах.
                    І звичайно ж, чекаю до себе на фотосесії!
                </p>
                <img src={back} alt="background-image" className="absolute z-[-1] top-0 right-0 opacity-50 object-contain h-[100%]" />
            </div>

        </section>
    )
}

export default About
